import React from 'react';

const DeliveryPayment = () => {
    return (
        <div className="component__container delivery__payment__page__container">
            <section>
                <h1>Доставка і оплата</h1>
                <p>- Сума мінімального замовлення у нашому інтернет-магазині - 250 грн.</p><br/>
                <p>- Усі замовлення обробляються протягом двох робочих днів після їх оформлення.</p>
            </section>

            <section>
                <h2>Способи оплати</h2>
                <p>- На картку ПриватБанку. Реквізити надсилає менеджер після обробки замовлення.</p><br/>
                <p>- При отриманні свого замовлення у відділенні Нова Пошта. Комісію за переказ коштів сплачує Покупець.</p>
            </section>

            <section>
                <h2>Способи доставки в межах України:</h2>
                <p>
                    - Усі замовлення ми відправляємо в межах України, за винятком тимчасово окупованих територій України
                    та АР Крим.
                </p>
                <p>
                    - Перевірку замовлення на предмет цілісності упаковки і відсутності зовнішніх пошкоджень товару
                    обов'язково здійснювати на місці - у відділенні служби доставки. При наявності пошкодження товару
                    під час перевезення вимагайте від працівників служби доставки скласти акт із зазначенням характеру
                    пошкодження товару і повідомте про це нам!
                </p>
                <p>
                    - Якщо ви замовили доставку в поштомат, перевірку замовлення на предмет цілісності упаковки і
                    відсутності зовнішніх пошкоджень товару теж обов'язково здійснювати на місці - при виявленні
                    пошкоджень клієнт може оформити претензію:<br/>
                    1) у будь-якому відділенні, де йому допоможуть заповнити<br/>
                    спеціальний бланк;
                    2) зателефонувавши до контакт-центру за номером 0 800 500 609. Термін розгляду
                    компенсації – до 3 днів з моменту запиту.
                </p>
                <p>https://novaposhta.ua/poshtomat/#faq</p>
                <p>
                    Зверніть увагу! При доставці до складу транспортної компанії, замовлення зберігається на складі не
                    більше 5 робочих днів, після чого повертається назад!
                </p>
            </section>
        </div>
    );
};

export default DeliveryPayment;