import React from 'react';
import {Helmet} from "react-helmet-async";
import {Col, Row} from "react-bootstrap";
import SideBar from "../components/SideBar.jsx";

const DeliveryPayment = () => {
    return (
        <>
            <Helmet>
                <title>Доставка і оплата – Charivna Craft</title>
                <meta
                    name="description"
                    content="Детальна інформація про умови доставки і оплати. Ознайомтесь з політикою магазину."
                />
            </Helmet>

            <div className="component__container delivery__payment__page__container">
                <Row>
                    <Col md={2}>
                        <SideBar/>
                    </Col>
                    <Col md={9}>
                        <h1>Доставка і оплата</h1>
                        <section>
                            <h2>Способи доставки</h2>
                            <p>
                                - Доставка Новою Поштою:<br/>
                                Здійснюється безкоштовно за умови вартості замовлення від 1500 грн.
                            </p>
                            <p>
                                - Доставка Укрпоштою:<br/>
                                Відправка через Укрпошту здійснюється тільки після повної оплати товару клієнтом.<br/>
                                Здійснюється безкоштовно за умови вартості замовлення від 1500 грн.
                            </p>
                            <p>
                                - Сума мінімального замовлення у нашому інтернет-магазині - 250 грн.<br/>
                                - Усі замовлення обробляються протягом двох робочих днів після їх оформлення.
                            </p>
                        </section>

                        <section>
                            <h2>Способи оплати</h2>
                            <p>
                                1. На картку ПриватБанку. Реквізити надсилає менеджер після обробки замовлення.<br/>
                                2. При отриманні свого замовлення у відділенні Нова Пошта. Комісію за переказ коштів сплачує
                                Покупець.<br/>
                                Ви оплачуєте вартість замовлення + доставку замовлення + вартість
                                повернення грошей (для Нової пошти ця сума складає 20 грн. + 2% від заявленої суми
                                замовлення).<br/>
                                3. Відправка Укрпоштою здійснюється тільки після повної оплати товару клієнтом.
                            </p>
                        </section>

                        <section>
                            <h2>Умови доставки в межах України:</h2>
                            <p>
                                - Усі замовлення ми відправляємо в межах України, за винятком тимчасово окупованих територій України
                                та АР Крим.<br/>
                                - Перевірку замовлення на предмет цілісності упаковки і відсутності зовнішніх пошкоджень товару
                                обов'язково здійснюйте на місці - у відділенні служби доставки. При наявності пошкодження товару
                                під час перевезення вимагайте від працівників служби доставки скласти акт із зазначенням характеру
                                пошкодження товару і повідомте про це нам!<br/>
                                - Якщо ви замовили доставку в поштомат, перевірку замовлення на предмет цілісності упаковки і
                                відсутності зовнішніх пошкоджень товару теж обов'язково здійснюйте на місці - при виявленні
                                пошкоджень клієнт може оформити претензію:<br/>
                                1) у будь-якому відділенні, де йому допоможуть заповнити
                                спеціальний бланк;<br/>
                                2) зателефонувавши до контакт-центру за номером 0 800 500 609. Термін розгляду
                                компенсації – до 3 днів з моменту запиту.
                                https://novaposhta.ua/poshtomat/#faq
                            </p>
                            <p>
                                Зверніть увагу! При доставці до складу транспортної компанії, замовлення зберігається на складі не
                                більше 5 робочих днів, після чого повертається назад!
                            </p>
                        </section>
                    </Col>
                </Row>
            </div>
        </>
    );
};

export default DeliveryPayment;